
# CAE backbone
network:
  # [from, number, module, args]
  [
   [-1, 1, Conv, [1024, 1, 1]], #0
   [-1, 1, Conv, [400, 1, 1]],  #1
   [-1, 1, Conv, [200, 1, 1]],  #2
   [-1, 1, Conv, [400, 1, 1]],  #3
   [-1, 1, Conv, [400, 1, 1]],  #4
   #[[1, 4], 1, SumBl, []],          
   [-1, 1, Conv, [1024, 1, 1]], #6     
   #[[0, 6], 1, SumBl, []],  
   [-1, 1, Conv2d, [0, 1, 1]],
   #[-1, 1, Conv, [0, 1, 1]],  
  ]