

# CAE backbone
network:
  # [from, number, module, args]
  [
   [-1, 1, Conv, [512, 3, 2, 1]],   #0 ori_size/2
   [-1, 1, Conv, [256, 3, 2, 1]],   #1 ori_size/4
   [-1, 1, Conv, [128, 3, 2, 1]],   #2 ori_size/8
   [-1, 1, Conv2d, [100, 3, 2, 1]],   #3 ori_size/ori_size
   [-1, 1, TConv2, [128, 3, 2, 1, 1]],  #4
   #[[2, 4], 1, SumBl, []],          #5     
   [-1, 1, TConv2, [256, 3, 2, 1, 1]],  #6 
   #[[1, 6], 1, SumBl, []],          #7
   [-1, 1, TConv2, [512, 3, 2, 1, 1]],  #8 
  # [[0, 8], 1, SumBl, []],          #9
   [-1, 1, ConvTranspose2d_2, [0, 3, 2, 1, 1]],
  ]