
# CAE backbone
network:
  # [from, number, module, args]
  [
   [-1, 1, Conv, [512, 4, 2, 1]],   #1 ori_size/4
   [-1, 1, Conv, [256, 4, 2, 1]],   #2 ori_size/8
   [-1, 1, Conv, [128, 4, 2, 1]],   #3 ori_size/16
   [-1, 1, Conv, [100, 4, 2, 1]],   #4 ori_size/ori_size
   [-1, 1, TConv, [128, 4, 2, 1]],   #5
   #[[3, 5], 1, SumBl, []],           #6     
   [-1, 1, TConv, [256, 4, 2, 1]],   #7
   #[[2, 7], 1, SumBl, []],           #8
   [-1, 1, TConv, [512, 4, 2, 1]],   #9 
   #[[1, 9], 1, SumBl, []],           #10
   [-1, 1, ConvTranspose2d, [0, 4, 2, 1]],
  ]