
# CAE backbone
network:
  # [from, number, module, args]
  [
   [-1, 1, Conv, [1024, 1, 1]], #0
   [-1, 1, Conv, [512, 1, 1]],  #1
   [-1, 1, Conv, [256, 1, 1]],  #2
   [-1, 1, Conv, [128, 1, 1]],  #3
   [-1, 1, Conv, [100, 1, 1]],  #4
   [-1, 1, Conv, [128, 1, 1]],  #5
   [[3, 5], 1, SumBl, []],          #6
   [-1, 1, Conv, [256, 1, 1]],      #7
   [[2, 7], 1, SumBl, []],          #8
   [-1, 1, Conv, [512, 1, 1]],      #9
   [[1, 9], 1, SumBl, []],          #10
   [-1, 1, Conv, [1024, 1, 1]],     #11
   [[0, 11], 1, SumBl, []],          #112
   [-1, 1, Conv2d, [0, 1, 1]],  
   [-1, 1, Tanh, []],
  ]