
# CAE backbone
network:
  # [from, number, module, args]
  [
   [-1, 1, Conv, [1024, 4, 2, 1]],  #0 32/2
   [-1, 1, Conv, [512, 4, 2, 1]],   #1 16/2
   [-1, 1, Conv, [512, 4, 2, 1]],   #2 8/2
   [-1, 1, Conv, [200, 4, 1, 0]],   #3
   [-1, 1, TConv, [512, 4, 1, 0]],  #4
   #[[2, 4], 1, SumBl, []],       #5
   [-1, 1, TConv, [512, 4, 2, 1]],  #6
   #[[1, 6], 1, SumBl, []],       #7      
   [-1, 1, TConv, [1024, 4, 2, 1]], #8     
   #[[0, 8], 1, SumBl, []],       #9
   #[-1, 1, TConv, [1024, 2, 1]], #10
   [-1, 1, ConvTranspose2d, [0, 4, 2, 1]],
  ]